import { Period } from "./components/HistoricalTimeline/types";


export const mockPeriods: Period[] = [
    // 2015-2022
    {
      id: 1,
      startYear: 2015,
      endYear: 2022,
      events: [
        // Наука
        {
          id: 101,
          year: 2015,
          category: "Наука",
          description:
            "Частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
        },
        {
          id: 102,
          year: 2016,
          category: "Наука",
          description: "Открытие гравитационных волн коллаборацией LIGO",
        },
        {
          id: 103,
          year: 2017,
          category: "Наука",
          description: "Первое изображение черной дыры в центре галактики M87",
        },
        {
          id: 104,
          year: 2018,
          category: "Наука",
          description: "Запуск космического телескопа TESS для поиска экзопланет",
        },
        {
          id: 105,
          year: 2019,
          category: "Наука",
          description:
            "Разработка нового типа квантового компьютера компанией Google",
        },
        {
          id: 106,
          year: 2020,
          category: "Наука",
          description:
            "Создание вакцин против COVID-19 в рекордно короткие сроки",
        },
  
        // Технологии
        {
          id: 107,
          year: 2015,
          category: "Технологии",
          description: "Выпуск операционной системы Windows 10",
        },
        {
          id: 108,
          year: 2016,
          category: "Технологии",
          description:
            "Релиз первого поколения очков дополненной реальности Microsoft HoloLens",
        },
        {
          id: 109,
          year: 2017,
          category: "Технологии",
          description:
            "Презентация iPhone X с системой распознавания лица Face ID",
        },
        {
          id: 110,
          year: 2018,
          category: "Технологии",
          description:
            "Запуск 5G сетей в коммерческую эксплуатацию в США и Южной Корее",
        },
        {
          id: 111,
          year: 2019,
          category: "Технологии",
          description:
            "Выпуск складных смартфонов Samsung Galaxy Fold и Huawei Mate X",
        },
        {
          id: 112,
          year: 2021,
          category: "Технологии",
          description:
            "Глобальный дефицит микрочипов, затронувший многие отрасли промышленности",
        },
  
        // Литература
        {
          id: 113,
          year: 2015,
          category: "Литература",
          description:
            "Нобелевская премия по литературе присуждена Светлане Алексиевич",
        },
        {
          id: 114,
          year: 2016,
          category: "Литература",
          description: "Нобелевская премия по литературе присуждена Бобу Дилану",
        },
        {
          id: 115,
          year: 2017,
          category: "Литература",
          description: 'Выход романа "Происхождение" Дэна Брауна',
        },
        {
          id: 116,
          year: 2018,
          category: "Литература",
          description:
            "Мариз Конде получает альтернативную Нобелевскую премию по литературе",
        },
        {
          id: 117,
          year: 2019,
          category: "Литература",
          description:
            "Ольга Токарчук и Петер Хандке получают Нобелевские премии по литературе",
        },
        {
          id: 118,
          year: 2021,
          category: "Литература",
          description:
            "Нобелевская премия по литературе присуждена Абдулразаку Гурне",
        },
  
        // Политика
        {
          id: 119,
          year: 2016,
          category: "Политика",
          description:
            "Референдум о выходе Великобритании из Европейского союза (Brexit)",
        },
        {
          id: 120,
          year: 2017,
          category: "Политика",
          description: "Дональд Трамп вступает в должность президента США",
        },
        {
          id: 121,
          year: 2018,
          category: "Политика",
          description: "Исторический саммит лидеров США и Северной Кореи",
        },
        {
          id: 122,
          year: 2019,
          category: "Политика",
          description:
            "Начало процедуры импичмента президента США Дональда Трампа",
        },
        {
          id: 123,
          year: 2020,
          category: "Политика",
          description: "Джо Байден избран президентом США",
        },
        {
          id: 124,
          year: 2022,
          category: "Политика",
          description: "Начало специальной военной операции России на Украине",
        },
  
        // Спорт
        {
          id: 125,
          year: 2016,
          category: "Спорт",
          description: "Летние Олимпийские игры в Рио-де-Жанейро, Бразилия",
        },
        {
          id: 126,
          year: 2018,
          category: "Спорт",
          description: "Чемпионат мира по футболу в России",
        },
        {
          id: 127,
          year: 2020,
          category: "Спорт",
          description: "Перенос Олимпийских игр в Токио из-за пандемии COVID-19",
        },
        {
          id: 128,
          year: 2021,
          category: "Спорт",
          description:
            "Проведение перенесенных Олимпийских игр в Токио без зрителей",
        },
        {
          id: 129,
          year: 2022,
          category: "Спорт",
          description: "Зимние Олимпийские игры в Пекине, Китай",
        },
        {
          id: 130,
          year: 2022,
          category: "Спорт",
          description: "Чемпионат мира по футболу в Катаре",
        },
  
        // Космос
        {
          id: 131,
          year: 2015,
          category: "Космос",
          description:
            "Аппарат New Horizons пролетает мимо Плутона, впервые делая детальные снимки планеты",
        },
        {
          id: 132,
          year: 2016,
          category: "Космос",
          description:
            "Запуск миссии ExoMars для поиска признаков жизни на Марсе",
        },
        {
          id: 133,
          year: 2018,
          category: "Космос",
          description:
            "Запуск марсохода Perseverance и вертолета Ingenuity на Марс",
        },
        {
          id: 134,
          year: 2019,
          category: "Космос",
          description: "Первое успешное фото черной дыры в центре галактики M87",
        },
        {
          id: 135,
          year: 2020,
          category: "Космос",
          description:
            "SpaceX осуществляет первый пилотируемый коммерческий полет к МКС",
        },
        {
          id: 136,
          year: 2021,
          category: "Космос",
          description: "Запуск космического телескопа James Webb",
        },
      ],
    },
  
    // 2010-2015
    {
      id: 2,
      startYear: 2010,
      endYear: 2015,
      events: [
        // Наука
        {
          id: 201,
          year: 2010,
          category: "Наука",
          description:
            "Создание первой в мире синтетической бактериальной клетки",
        },
        {
          id: 202,
          year: 2011,
          category: "Наука",
          description: "Обнаружение возможных следов воды на Марсе",
        },
        {
          id: 203,
          year: 2012,
          category: "Наука",
          description: "Открытие бозона Хиггса в ЦЕРНе",
        },
        {
          id: 204,
          year: 2013,
          category: "Наука",
          description: "Секвенирование ДНК вымершего мамонта",
        },
        {
          id: 205,
          year: 2014,
          category: "Наука",
          description:
            "Посадка космического аппарата Розетта на комету Чурюмова-Герасименко",
        },
        {
          id: 206,
          year: 2015,
          category: "Наука",
          description: "Открытие жидкой воды на поверхности Марса",
        },
  
        // Технологии
        {
          id: 207,
          year: 2010,
          category: "Технологии",
          description: "Выпуск первого планшета iPad компанией Apple",
        },
        {
          id: 208,
          year: 2011,
          category: "Технологии",
          description: "Запуск облачного сервиса iCloud компанией Apple",
        },
        {
          id: 209,
          year: 2012,
          category: "Технологии",
          description: "Выпуск Windows 8 компанией Microsoft",
        },
        {
          id: 210,
          year: 2013,
          category: "Технологии",
          description: "Выпуск игровой приставки PlayStation 4 компанией Sony",
        },
        {
          id: 211,
          year: 2014,
          category: "Технологии",
          description: "Facebook приобретает WhatsApp за $19 млрд",
        },
        {
          id: 212,
          year: 2015,
          category: "Технологии",
          description: "Выпуск первых умных часов Apple Watch",
        },
  
        // Литература
        {
          id: 213,
          year: 2010,
          category: "Литература",
          description:
            "Марио Варгас Льоса получает Нобелевскую премию по литературе",
        },
        {
          id: 214,
          year: 2011,
          category: "Литература",
          description: "Выход последней книги серии о Гарри Поттере в фильмах",
        },
        {
          id: 215,
          year: 2012,
          category: "Литература",
          description: "Мо Янь получает Нобелевскую премию по литературе",
        },
        {
          id: 216,
          year: 2013,
          category: "Литература",
          description: "Элис Манро получает Нобелевскую премию по литературе",
        },
        {
          id: 217,
          year: 2014,
          category: "Литература",
          description: "Патрик Модиано получает Нобелевскую премию по литературе",
        },
        {
          id: 218,
          year: 2015,
          category: "Литература",
          description: 'Выход романа "Серая гора" Джонатана Франзена',
        },
  
        // Политика
        {
          id: 219,
          year: 2010,
          category: "Политика",
          description:
            'Начало "Арабской весны" – волны протестов на Ближнем Востоке',
        },
        {
          id: 220,
          year: 2011,
          category: "Политика",
          description: "Смерть Усамы бен Ладена",
        },
        {
          id: 221,
          year: 2012,
          category: "Политика",
          description: "Переизбрание Барака Обамы на второй срок",
        },
        {
          id: 222,
          year: 2013,
          category: "Политика",
          description: "Избрание Папы Франциска после отречения Бенедикта XVI",
        },
        {
          id: 223,
          year: 2014,
          category: "Политика",
          description: "Присоединение Крыма к России",
        },
        {
          id: 224,
          year: 2015,
          category: "Политика",
          description: "Подписание ядерной сделки с Ираном",
        },
  
        // Спорт
        {
          id: 225,
          year: 2010,
          category: "Спорт",
          description: "Зимние Олимпийские игры в Ванкувере, Канада",
        },
        {
          id: 226,
          year: 2010,
          category: "Спорт",
          description: "Чемпионат мира по футболу в ЮАР",
        },
        {
          id: 227,
          year: 2012,
          category: "Спорт",
          description: "Летние Олимпийские игры в Лондоне, Великобритания",
        },
        {
          id: 228,
          year: 2014,
          category: "Спорт",
          description: "Зимние Олимпийские игры в Сочи, Россия",
        },
        {
          id: 229,
          year: 2014,
          category: "Спорт",
          description: "Чемпионат мира по футболу в Бразилии",
        },
        {
          id: 230,
          year: 2015,
          category: "Спорт",
          description: "Коррупционный скандал в FIFA",
        },
  
        // Космос
        {
          id: 231,
          year: 2011,
          category: "Космос",
          description: "Завершение программы космических шаттлов NASA",
        },
        {
          id: 232,
          year: 2012,
          category: "Космос",
          description: "Марсоход Curiosity успешно совершает посадку на Марс",
        },
        {
          id: 233,
          year: 2013,
          category: "Космос",
          description: "Запуск лунного орбитального аппарата LADEE",
        },
        {
          id: 234,
          year: 2014,
          category: "Космос",
          description:
            "Космический аппарат Rosetta прибывает к комете Чурюмова-Герасименко",
        },
        {
          id: 235,
          year: 2015,
          category: "Космос",
          description: "Аппарат New Horizons делает первые крупные планы Плутона",
        },
        {
          id: 236,
          year: 2015,
          category: "Космос",
          description:
            "SpaceX осуществляет первую успешную посадку первой ступени ракеты",
        },
      ],
    },
  
    // 2005-2010
    {
      id: 3,
      startYear: 2005,
      endYear: 2010,
      events: [
        // Наука
        {
          id: 301,
          year: 2005,
          category: "Наука",
          description: "Первое полное секвенирование генома шимпанзе",
        },
        {
          id: 302,
          year: 2006,
          category: "Наука",
          description: "Плутон лишён статуса планеты",
        },
        {
          id: 303,
          year: 2007,
          category: "Наука",
          description: "Активация Большого адронного коллайдера",
        },
        {
          id: 304,
          year: 2008,
          category: "Наука",
          description: "Открытие бозона Хиггса в ЦЕРНе",
        },
        {
          id: 305,
          year: 2009,
          category: "Наука",
          description: "Обнаружение воды на Луне",
        },
        {
          id: 306,
          year: 2010,
          category: "Наука",
          description: "Создание первой искусственной бактериальной клетки",
        },
  
        // Технологии
        {
          id: 307,
          year: 2005,
          category: "Технологии",
          description: "Запуск видеохостинга YouTube",
        },
        {
          id: 308,
          year: 2006,
          category: "Технологии",
          description: "Запуск социальной сети Twitter",
        },
        {
          id: 309,
          year: 2007,
          category: "Технологии",
          description: "Выпуск первого iPhone",
        },
        {
          id: 310,
          year: 2008,
          category: "Технологии",
          description: "Запуск браузера Google Chrome",
        },
        {
          id: 311,
          year: 2009,
          category: "Технологии",
          description: "Выпуск операционной системы Windows 7",
        },
        {
          id: 312,
          year: 2010,
          category: "Технологии",
          description: "Выпуск первого iPad",
        },
  
        // Литература
        {
          id: 313,
          year: 2005,
          category: "Литература",
          description: "Гарольд Пинтер получает Нобелевскую премию по литературе",
        },
        {
          id: 314,
          year: 2006,
          category: "Литература",
          description: "Орхан Памук получает Нобелевскую премию по литературе",
        },
        {
          id: 315,
          year: 2007,
          category: "Литература",
          description: "Дорис Лессинг получает Нобелевскую премию по литературе",
        },
        {
          id: 316,
          year: 2008,
          category: "Литература",
          description:
            "Жан-Мари Гюстав Леклезио получает Нобелевскую премию по литературе",
        },
        {
          id: 317,
          year: 2009,
          category: "Литература",
          description: "Херта Мюллер получает Нобелевскую премию по литературе",
        },
        {
          id: 318,
          year: 2010,
          category: "Литература",
          description:
            "Марио Варгас Льоса получает Нобелевскую премию по литературе",
        },
  
        // Политика
        {
          id: 319,
          year: 2005,
          category: "Политика",
          description:
            "Ангела Меркель становится первой женщиной-канцлером Германии",
        },
        {
          id: 320,
          year: 2006,
          category: "Политика",
          description: "Садам Хусейн казнен в Ираке",
        },
        {
          id: 321,
          year: 2007,
          category: "Политика",
          description: "Николя Саркози избран президентом Франции",
        },
        {
          id: 322,
          year: 2008,
          category: "Политика",
          description:
            "Барак Обама избран первым афроамериканским президентом США",
        },
        {
          id: 323,
          year: 2009,
          category: "Политика",
          description: "Барак Обама получает Нобелевскую премию мира",
        },
        {
          id: 324,
          year: 2010,
          category: "Политика",
          description: 'Начало "Арабской весны" в Тунисе',
        },
  
        // Спорт
        {
          id: 325,
          year: 2006,
          category: "Спорт",
          description: "Зимние Олимпийские игры в Турине, Италия",
        },
        {
          id: 326,
          year: 2006,
          category: "Спорт",
          description: "Чемпионат мира по футболу в Германии",
        },
        {
          id: 327,
          year: 2008,
          category: "Спорт",
          description: "Летние Олимпийские игры в Пекине, Китай",
        },
        {
          id: 328,
          year: 2009,
          category: "Спорт",
          description:
            "Усэйн Болт устанавливает мировой рекорд в беге на 100 м (9,58 с)",
        },
        {
          id: 329,
          year: 2010,
          category: "Спорт",
          description: "Зимние Олимпийские игры в Ванкувере, Канада",
        },
        {
          id: 330,
          year: 2010,
          category: "Спорт",
          description:
            "Чемпионат мира по футболу в ЮАР, первый на африканском континенте",
        },
  
        // Космос
        {
          id: 331,
          year: 2005,
          category: "Космос",
          description:
            'Зонд "Хьюгенс" совершает посадку на Титан, спутник Сатурна',
        },
        {
          id: 332,
          year: 2006,
          category: "Космос",
          description: 'Запуск миссии "Новые горизонты" к Плутону',
        },
        {
          id: 333,
          year: 2007,
          category: "Космос",
          description: "Запуск японского лунного орбитального аппарата SELENE",
        },
        {
          id: 334,
          year: 2008,
          category: "Космос",
          description: "Запуск телескопа Кеплер для поиска экзопланет",
        },
        {
          id: 335,
          year: 2009,
          category: "Космос",
          description: "Запуск космического телескопа Гершель",
        },
        {
          id: 336,
          year: 2010,
          category: "Космос",
          description:
            "Запуск первого частного космического корабля SpaceX Dragon",
        },
      ],
    },
  
    // 2000-2005
    {
      id: 4,
      startYear: 2000,
      endYear: 2005,
      events: [
        // Наука
        {
          id: 401,
          year: 2000,
          category: "Наука",
          description:
            'Завершение проекта "Геном человека" - первое полное секвенирование человеческого генома',
        },
        {
          id: 402,
          year: 2001,
          category: "Наука",
          description:
            "Создание первого самовоспроизводящегося синтетического организма",
        },
        {
          id: 403,
          year: 2002,
          category: "Наука",
          description: "Открытие нового типа нейронов в мозге человека",
        },
        {
          id: 404,
          year: 2003,
          category: "Наука",
          description: "Обнаружение воды на Марсе роверами Spirit и Opportunity",
        },
        {
          id: 405,
          year: 2004,
          category: "Наука",
          description: "Открытие графена, революционного материала",
        },
        {
          id: 406,
          year: 2005,
          category: "Наука",
          description:
            "Первое клонирование человеческих эмбрионов в исследовательских целях",
        },
  
        // Технологии
        {
          id: 407,
          year: 2000,
          category: "Технологии",
          description: "Выпуск операционной системы Windows 2000",
        },
        {
          id: 408,
          year: 2001,
          category: "Технологии",
          description: "Выпуск первого iPod компанией Apple",
        },
        {
          id: 409,
          year: 2003,
          category: "Технологии",
          description: "Запуск социальной сети LinkedIn",
        },
        {
          id: 410,
          year: 2004,
          category: "Технологии",
          description: "Запуск социальной сети Facebook",
        },
        {
          id: 411,
          year: 2004,
          category: "Технологии",
          description: "Основание компании Mozilla и выпуск браузера Firefox",
        },
        {
          id: 412,
          year: 2005,
          category: "Технологии",
          description: "Запуск видеохостинга YouTube",
        },
  
        // Литература
        {
          id: 413,
          year: 2000,
          category: "Литература",
          description: "Гао Синцзянь получает Нобелевскую премию по литературе",
        },
        {
          id: 414,
          year: 2001,
          category: "Литература",
          description: "В. С. Найпол получает Нобелевскую премию по литературе",
        },
        {
          id: 415,
          year: 2002,
          category: "Литература",
          description: "Имре Кертес получает Нобелевскую премию по литературе",
        },
        {
          id: 416,
          year: 2003,
          category: "Литература",
          description: "Дж. М. Кутзее получает Нобелевскую премию по литературе",
        },
        {
          id: 417,
          year: 2004,
          category: "Литература",
          description:
            "Эльфрида Елинек получает Нобелевскую премию по литературе",
        },
        {
          id: 418,
          year: 2005,
          category: "Литература",
          description: "Гарольд Пинтер получает Нобелевскую премию по литературе",
        },
  
        // Политика
        {
          id: 419,
          year: 2000,
          category: "Политика",
          description: "Владимир Путин впервые избран президентом России",
        },
        {
          id: 420,
          year: 2001,
          category: "Политика",
          description: "Террористические атаки 11 сентября в США",
        },
        {
          id: 421,
          year: 2002,
          category: "Политика",
          description:
            "Введение евро в качестве единой валюты в странах Еврозоны",
        },
        {
          id: 422,
          year: 2003,
          category: "Политика",
          description: "Начало войны в Ираке",
        },
        {
          id: 423,
          year: 2004,
          category: "Политика",
          description: "Расширение Европейского союза на 10 новых стран-членов",
        },
        {
          id: 424,
          year: 2005,
          category: "Политика",
          description:
            "Ангела Меркель становится первой женщиной-канцлером Германии",
        },
  
        // Спорт
        {
          id: 425,
          year: 2000,
          category: "Спорт",
          description: "Летние Олимпийские игры в Сиднее, Австралия",
        },
        {
          id: 426,
          year: 2002,
          category: "Спорт",
          description: "Зимние Олимпийские игры в Солт-Лейк-Сити, США",
        },
        {
          id: 427,
          year: 2002,
          category: "Спорт",
          description: "Чемпионат мира по футболу в Японии и Южной Корее",
        },
        {
          id: 428,
          year: 2004,
          category: "Спорт",
          description: "Летние Олимпийские игры в Афинах, Греция",
        },
        {
          id: 429,
          year: 2004,
          category: "Спорт",
          description: "Чемпионат Европы по футболу в Португалии",
        },
        {
          id: 430,
          year: 2005,
          category: "Спорт",
          description:
            'Футбольный клуб "Ливерпуль" выигрывает Лигу чемпионов УЕФА в драматичном финале',
        },
  
        // Космос
        {
          id: 431,
          year: 2000,
          category: "Космос",
          description:
            "Первый экипаж прибывает на Международную космическую станцию",
        },
        {
          id: 432,
          year: 2001,
          category: "Космос",
          description:
            "Первый космический турист Деннис Тито отправляется на МКС",
        },
        {
          id: 433,
          year: 2003,
          category: "Космос",
          description: "Катастрофа космического шаттла Columbia",
        },
        {
          id: 434,
          year: 2004,
          category: "Космос",
          description: "Запуск марсоходов Spirit и Opportunity",
        },
        {
          id: 435,
          year: 2004,
          category: "Космос",
          description: "Завершение миссии зонда Cassini-Huygens к Сатурну",
        },
        {
          id: 436,
          year: 2005,
          category: "Космос",
          description:
            'Зонд "Хьюгенс" совершает посадку на Титан, спутник Сатурна',
        },
      ],
    },
  
    // 1995-2000
    {
      id: 5,
      startYear: 1995,
      endYear: 2000,
      events: [
        // Наука
        {
          id: 501,
          year: 1995,
          category: "Наука",
          description: "Открытие первой экзопланеты вокруг солнцеподобной звезды",
        },
        {
          id: 502,
          year: 1996,
          category: "Наука",
          description:
            "Клонирование овечки Долли - первое клонирование млекопитающего",
        },
        {
          id: 503,
          year: 1997,
          category: "Наука",
          description: "Нобелевская премия по медицине за открытие прионов",
        },
        {
          id: 504,
          year: 1998,
          category: "Наука",
          description: "Открытие ускоренного расширения Вселенной",
        },
        {
          id: 505,
          year: 1999,
          category: "Наука",
          description: "Первые успешные эксперименты по квантовой телепортации",
        },
        {
          id: 506,
          year: 2000,
          category: "Наука",
          description: 'Завершение проекта "Геном человека"',
        },
  
        // Технологии
        {
          id: 507,
          year: 1995,
          category: "Технологии",
          description: "Выпуск Windows 95 компанией Microsoft",
        },
        {
          id: 508,
          year: 1996,
          category: "Технологии",
          description: "Появление технологии USB (Universal Serial Bus)",
        },
        {
          id: 509,
          year: 1997,
          category: "Технологии",
          description: "Запуск поисковой системы Google",
        },
        {
          id: 510,
          year: 1998,
          category: "Технологии",
          description: "Основание компании PayPal",
        },
        {
          id: 511,
          year: 1999,
          category: "Технологии",
          description: "Создание формата файлов MP3",
        },
        {
          id: 512,
          year: 2000,
          category: "Технологии",
          description: 'Проблема "Миллениум" (Y2K) и ее предотвращение',
        },
  
        // Литература
        {
          id: 513,
          year: 1995,
          category: "Литература",
          description: "Шеймас Хини получает Нобелевскую премию по литературе",
        },
        {
          id: 514,
          year: 1996,
          category: "Литература",
          description:
            "Вислава Шимборская получает Нобелевскую премию по литературе",
        },
        {
          id: 515,
          year: 1997,
          category: "Литература",
          description: "Дарио Фо получает Нобелевскую премию по литературе",
        },
        {
          id: 516,
          year: 1998,
          category: "Литература",
          description: "Жозе Сарамаго получает Нобелевскую премию по литературе",
        },
        {
          id: 517,
          year: 1999,
          category: "Литература",
          description: "Гюнтер Грасс получает Нобелевскую премию по литературе",
        },
        {
          id: 518,
          year: 1997,
          category: "Литература",
          description: "Публикация первой книги о Гарри Поттере Джоан Роулинг",
        },
  
        // Политика
        {
          id: 519,
          year: 1995,
          category: "Политика",
          description: "Дейтонские соглашения завершают войну в Боснии",
        },
        {
          id: 520,
          year: 1996,
          category: "Политика",
          description: "Талибан захватывает власть в Афганистане",
        },
        {
          id: 521,
          year: 1997,
          category: "Политика",
          description: "Возвращение Гонконга под суверенитет Китая",
        },
        {
          id: 522,
          year: 1998,
          category: "Политика",
          description: "Подписание Белфастского соглашения в Северной Ирландии",
        },
        {
          id: 523,
          year: 1999,
          category: "Политика",
          description: "Война НАТО против Югославии",
        },
        {
          id: 524,
          year: 1999,
          category: "Политика",
          description:
            "Отставка Бориса Ельцина, назначение В.В. Путина и.о. президента России",
        },
  
        // Спорт
        {
          id: 525,
          year: 1996,
          category: "Спорт",
          description: "Летние Олимпийские игры в Атланте, США",
        },
        {
          id: 526,
          year: 1998,
          category: "Спорт",
          description: "Зимние Олимпийские игры в Нагано, Япония",
        },
        {
          id: 527,
          year: 1998,
          category: "Спорт",
          description: "Чемпионат мира по футболу во Франции",
        },
        {
          id: 528,
          year: 1999,
          category: "Спорт",
          description:
            "Манчестер Юнайтед выигрывает требл: Премьер-лигу, Кубок Англии и Лигу чемпионов",
        },
        {
          id: 529,
          year: 2000,
          category: "Спорт",
          description: "Летние Олимпийские игры в Сиднее, Австралия",
        },
        {
          id: 530,
          year: 2000,
          category: "Спорт",
          description: "Чемпионат Европы по футболу в Бельгии и Нидерландах",
        },
  
        // Космос
        {
          id: 531,
          year: 1995,
          category: "Космос",
          description:
            'Стыковка орбитального корабля "Атлантис" с российской станцией "Мир"',
        },
        {
          id: 532,
          year: 1996,
          category: "Космос",
          description: "Запуск зонда Mars Pathfinder к Марсу",
        },
        {
          id: 533,
          year: 1997,
          category: "Космос",
          description: "Запуск марсохода Sojourner на Марс",
        },
        {
          id: 534,
          year: 1998,
          category: "Космос",
          description: "Запуск первого модуля Международной космической станции",
        },
        {
          id: 535,
          year: 1999,
          category: "Космос",
          description: "Создание Европейского космического агентства",
        },
        {
          id: 536,
          year: 2000,
          category: "Космос",
          description:
            "Первый экипаж прибывает на Международную космическую станцию",
        },
      ],
    },
  
    // 1990-1995
    {
      id: 6,
      startYear: 1990,
      endYear: 1995,
      events: [
        // Наука
        {
          id: 601,
          year: 1990,
          category: "Наука",
          description: "Запуск космического телескопа Хаббл (Hubble)",
        },
        {
          id: 602,
          year: 1991,
          category: "Наука",
          description: "Обнаружение первых экзопланет",
        },
        {
          id: 603,
          year: 1992,
          category: "Наука",
          description: "Открытие первых признаков темной материи",
        },
        {
          id: 604,
          year: 1993,
          category: "Наука",
          description: "Клонирование человеческого эмбриона",
        },
        {
          id: 605,
          year: 1994,
          category: "Наука",
          description: "Открытие гена, ответственного за болезнь Паркинсона",
        },
        {
          id: 606,
          year: 1995,
          category: "Наука",
          description: "Получение конденсата Бозе-Эйнштейна",
        },
  
        // Технологии
        {
          id: 607,
          year: 1990,
          category: "Технологии",
          description: "Создание World Wide Web (WWW) Тимом Бернерсом-Ли",
        },
        {
          id: 608,
          year: 1991,
          category: "Технологии",
          description: "Линус Торвальдс создает операционную систему Linux",
        },
        {
          id: 609,
          year: 1992,
          category: "Технологии",
          description: "Выпуск операционной системы Windows 3.1",
        },
        {
          id: 610,
          year: 1993,
          category: "Технологии",
          description: "Выпуск первого веб-браузера Mosaic",
        },
        {
          id: 611,
          year: 1994,
          category: "Технологии",
          description: "Создание компании Yahoo!",
        },
        {
          id: 612,
          year: 1995,
          category: "Технологии",
          description: "Выпуск Windows 95 компанией Microsoft",
        },
  
        // Литература
        {
          id: 613,
          year: 1990,
          category: "Литература",
          description: "Октавио Пас получает Нобелевскую премию по литературе",
        },
        {
          id: 614,
          year: 1991,
          category: "Литература",
          description: "Надин Гордимер получает Нобелевскую премию по литературе",
        },
        {
          id: 615,
          year: 1992,
          category: "Литература",
          description: "Дерек Уолкотт получает Нобелевскую премию по литературе",
        },
        {
          id: 616,
          year: 1993,
          category: "Литература",
          description: "Тони Моррисон получает Нобелевскую премию по литературе",
        },
        {
          id: 617,
          year: 1994,
          category: "Литература",
          description: "Кэндзабуро Оэ получает Нобелевскую премию по литературе",
        },
        {
          id: 618,
          year: 1995,
          category: "Литература",
          description: "Шеймас Хини получает Нобелевскую премию по литературе",
        },
  
        // Политика
        {
          id: 619,
          year: 1990,
          category: "Политика",
          description:
            "Освобождение Нельсона Манделы после 27 лет тюремного заключения",
        },
        {
          id: 620,
          year: 1991,
          category: "Политика",
          description: "Распад СССР и образование СНГ",
        },
        {
          id: 621,
          year: 1992,
          category: "Политика",
          description:
            "Подписание Маастрихтского договора о создании Европейского союза",
        },
        {
          id: 622,
          year: 1993,
          category: "Политика",
          description: "Принятие новой Конституции Российской Федерации",
        },
        {
          id: 623,
          year: 1994,
          category: "Политика",
          description: "Начало первой чеченской войны",
        },
        {
          id: 624,
          year: 1995,
          category: "Политика",
          description: "Дейтонские соглашения завершают войну в Боснии",
        },
  
        // Спорт
        {
          id: 625,
          year: 1990,
          category: "Спорт",
          description: "Чемпионат мира по футболу в Италии",
        },
        {
          id: 626,
          year: 1992,
          category: "Спорт",
          description: "Летние Олимпийские игры в Барселоне, Испания",
        },
        {
          id: 627,
          year: 1992,
          category: "Спорт",
          description: "Зимние Олимпийские игры в Альбервиле, Франция",
        },
        {
          id: 628,
          year: 1994,
          category: "Спорт",
          description: "Зимние Олимпийские игры в Лиллехаммере, Норвегия",
        },
        {
          id: 629,
          year: 1994,
          category: "Спорт",
          description: "Чемпионат мира по футболу в США",
        },
        {
          id: 630,
          year: 1995,
          category: "Спорт",
          description: "Победа Аякса в Лиге чемпионов УЕФА",
        },
  
        // Космос
        {
          id: 631,
          year: 1990,
          category: "Космос",
          description: "Запуск космического телескопа Хаббл",
        },
        {
          id: 632,
          year: 1991,
          category: "Космос",
          description: "Запуск космической станции 'Мир' в полную эксплуатацию",
        },
        {
          id: 633,
          year: 1992,
          category: "Космос",
          description: "Открытие первых экзопланет вокруг пульсара",
        },
        {
          id: 634,
          year: 1993,
          category: "Космос",
          description: "Миссия STS-61 для ремонта телескопа Хаббл",
        },
        {
          id: 635,
          year: 1994,
          category: "Космос",
          description: "Столкновение кометы Шумейкеров-Леви 9 с Юпитером",
        },
        {
          id: 636,
          year: 1995,
          category: "Космос",
          description:
            "Первая стыковка американского шаттла с российской станцией 'Мир'",
        },
      ],
    },
  ];